<?php
// header
	$lang['plikli_version'] = '4.1.0';
	$lang['installer'] = 'Installer';
	$lang['Welcome'] = 'Welcome';
	$lang['Install'] = 'Установить';
	$lang['Upgrade'] = 'Upgrade';
	$lang['Upgrade-Kliqqi'] = 'Upgrade-Kliqqi';
	$lang['Upgrade-Pligg'] = 'Upgrade-Pligg';
	$lang['Troubleshooter'] = 'Устранение неполадок';
	$lang['Step'] = 'Step';
	$lang['Readme'] = 'Readme';
	$lang['Admin'] = 'Dashboard';
	$lang['Home'] = 'Home';
	$lang['Install_instruct'] = 'Пожалуйста, используйте свою информацию в MySQL. См. Обновление для обновления существующего сайта. ';
	$lang['Upgrade_instruct'] = 'Модернизация внесет изменения в вашу базу данных MySQL. Обязательно выполните резервное копирование перед продолжением. ';
	$lang['Troubleshooter_instruct'] = 'Устранение неполадок обнаружит общие проблемы, такие как неправильные права доступа к папке';

// intro / step 1
	$lang['WelcomeToInstaller'] = 'Добро пожаловать в Plikli CMS Installer!';
	$lang['Введение'] = 'Введение';
	$lang['WelcomeToThe'] = 'Добро пожаловать в <a href="https://www.plikli.com" target="_blank" rel="noopener noreferrer"> Plikli </a>, CMS, который поддерживает тысячи сайты сообщества. Если вы впервые установили Plikli CMS, внимательно прочитайте все предоставленные инструкции, чтобы вы не пропустили никаких важных направлений. ';
	$lang['Bugs'] = 'Пожалуйста, ознакомьтесь с некоторыми документами, предоставленными сообществом Plikli на странице <a href="https://www.plikli.com/forum-2/"> Plikli Forum </a> веб-сайт. Мы также предлагаем вам зарегистрировать учетную запись, чтобы у вас был доступ к бесплатной поддержке, модулям, виджетам, шаблонам и другим отличным ресурсам. ';
	$lang['Installation'] = 'Установка (пожалуйста, внимательно прочтите)';
	$lang['OnceFamiliar'] = '<p> Если вы впервые устанавливаете Plikli, вы должны продолжить работу на этой странице, внимательно следуя инструкциям ниже. Если вам нужно <a href="./upgrade.php"> обновить свой сайт </a> из предыдущей версии, запустите сценарий обновления, нажав ссылку Upgrade выше. ПРЕДУПРЕЖДЕНИЕ: при запуске процесса установки на существующей базе данных сайта Plikli будут перезаписаны все данные, поэтому убедитесь, что вы хотите выполнить установку, если вы решите продолжить работу ниже. </P> <br />
	<ol>
		<li> Переименуйте settings.php.default в settings.php </li>
		<li> Переименуйте /languages/lang_english.conf.default в lang_english.conf </li>
		<li> Переименуйте /libs/dbconnect.php.default в dbconnect.php </li>
		<li> Переименуйте каталог /logs.default в /logs </li>
		<li> CHMOD 0777 следующие папки:
			<ol>
				<li>/admin/backup/</li>
				<li>/avatars/groups_uploaded/</li>
				<li>/avatars/user_uploaded/</li>
				<li>/cache/</li>
				<li>/languages​​/ (CHMOD 0777 все файлы, содержащиеся в этой папке) </li>
			</ol>
		</Li>
		<li> CHMOD 0666 следующие файлы:
			<ol>
				<Li> /libs/dbconnect.php </li>
				<Li> settings.php </li>
			</ol>
		</Li>
	</ol>
	<p> Ты пройдёшь самую сложную часть! Перейдите к следующему шагу, чтобы установить Plikli в вашу базу данных MySQL. </P> ';

// step 2
	$lang['EnterMySQL'] = 'Введите настройки базы данных MySQL ниже. Если вы не знаете свои настройки базы данных MySQL, вы должны проверить свою документацию в веб-хостинге или напрямую связаться с ними. ';
	$lang['DatabaseName'] = 'Имя базы данных';
	$lang['DatabaseUsername'] = 'Имя базы данных';
	$lang['DatabasePassword'] = 'Пароль базы данных';
	$lang['DatabaseServer'] = 'Сервер баз данных';
	$lang['TablePrefix'] = 'Префикс таблицы';
	$lang['PrefixExample'] = '(т. е.: «plikli_» делает таблицы для пользователей, становящимися plikli_users)';
	$lang['CheckSettings'] = 'Проверить настройки';
	$lang['Errors'] = '<br /> <br /> Пожалуйста, исправьте приведенные выше ошибки, затем <a class = "btn btn-default btn-xs" onClick = "document.location.reload (true ) "> Обновить страницу </a> ';
	$lang['LangNotFound'] = 'не найден. Удалите расширение \'.default\' из всех языковых файлов и повторите попытку. ';

// step 3
	$lang['ConnectionEstab'] = 'Установлено соединение с базой данных ...';
	$lang['FoundDb'] = 'Найдена база данных ...';
	$lang['dbconnect'] = '\'/libs/dbconnect.php\' успешно обновлен.';
	$lang['NoErrors'] = 'Не было ошибок, перейдите к следующему шагу ...';
	$lang['Next'] = 'Следующий шаг';
	$lang['GoBack'] = 'Вернуться назад и попробуйте снова';
	$lang['Error2-1'] = 'Не удалось записать файл \'/libs/dbconnect.php\'.';
	$lang['Error2-2'] = 'Не удалось открыть файл \'/libs/dbconnect.php\' для записи.';
	$lang['Error2-3'] = 'Подключено к базе данных, но имя базы данных неверно.';
	$lang['Error2-4'] = 'Не удается подключиться к серверу базы данных, используя предоставленную информацию.';

// step 4
	$lang['CreateTables'] = 'Создание таблиц базы данных';
	$lang['TablesGood'] = '<strong> Таблицы были созданы успешно! </strong>';
	$lang['Error3-1'] = '<p> Не удалось создать таблицы. </p>';
	$lang['Error3-2'] = '<p> Не удалось подключиться к базе данных. </p>';
	$lang['EnterAdmin'] = '<p> <strong> Введите данные учетной записи администратора ниже: </strong> <br /> Пожалуйста, запишите эту информацию об учетной записи, потому что она понадобится для входа и настройки вашего сайта. < / р> ';
	$lang['AdminLogin'] = 'Admin Login';
	$lang['AdminPassword'] = 'Пароль администратора';
	$lang['ConfirmPassword'] = 'Confirm Password';
	$lang['AdminEmail'] = 'Admin E-mail';
	$lang['SiteTitleLabel'] = 'Название сайта';
	$lang['CreateAdmin'] = 'Создать учетную запись администратора';
	$lang['pwndPassword'] = 'Вы ввели общий и небезопасный пароль!';

// Step 5
	$lang['Error5-1'] = 'Пожалуйста, заполните все поля для учетной записи администратора.';
	$lang['Error5-2'] = 'Поля пароля не совпадают. Вернитесь назад и снова введите поля пароля. ';
	$lang['AddingAdmin'] = 'Добавление учетной записи пользователя Admin ...';
	$lang['InstallSuccess'] = 'Установка завершена!';
	$lang['InstallSuccessMessage'] = 'Поздравляем, вы создали сайт Plikli CMS! Пока ваш сайт полностью работоспособен, вы захотите немного очистить его, следуя инструкциям ниже, чтобы защитить свой сайт. ';
	$lang['WhatToDo'] = 'Что делать дальше:';
	$lang['WhatToDoList'] = '<li> chmod "/libs/dbconnect.php" Вернуться к 644, нам не нужно будет снова менять этот файл. </li>
	<li> <strong> УДАЛИТЬ </strong> каталог "/install" с вашего сервера, если вы успешно установили Plikli. </li>
	<li> Войдите в <a href="../admin/admin_index.php"> панель мониторинга </a>, используя информацию пользователя, введенную с предыдущего шага. После входа в систему вам следует предоставить дополнительную информацию о том, как использовать Plikli. </Li>
	<li> <a href="../admin/admin_config.php"> Настройте свой сайт </a> с помощью панели управления. </li>
	<li> Посетите веб-сайт <a href="https://www.plikli.com/forum-2/"> Plikli Support </a>, если у вас есть какие-либо вопросы. </li> ';
	$lang['ContinueToSite'] = 'Продолжить свой новый сайт';

// Upgrade
	$lang['UpgradeHome'] = '<p style = "text-decoration: underline"> Обновление позволяет <STRONG> IRREVERSIBLE </STRONG> изменять вашу базу данных. РЕЗЕРВНЫЙ ВАШИ ТАБЛИЦЫ БАЗЫ ДАННЫХ ПЕРЕД ТЕМ, ЧТО ВЫ ПРОИЗОШЛИ ЛЮБОЕ ДАЛЬНЕЙШЕЕ И УБЕДИТЕСЬ, ЧТО ВАША БАЗА ДАННЫХ ЭКСПОРТИРОВАНА С ПРОВЕРЕННЫМ «УСТРОЙСТВОМ ТАБЛИЦЫ ЕСЛИ СУЩЕСТВУЕТ!» </P> <p> НЕ ПРОИЗОШЛО С ОБНОВЛЕНИЕМ, ЕСЛИ ВЫ СДЕЛАЛИ ЛЮБЫЕ НАСТРОЙКИ ДЛЯ ВАШИХ ОСНОВНЫХ ФАЙЛОВ. ПЕРВЫЙ, ВЫ ДОЛЖНЫ СДЕЛАТЬ СЛЕДУЮЩИЕ: </p>
	<UL>
	<li> ИСПОЛЬЗОВАНИЕ КОПИРОВАНИЯ ОБРАТНЫХ ФАЙЛОВ, СЛУЖАЙТЕ СВОИ ФАЙЛЫ С НОВЫМИ ФАЙЛАМИ KLIQQI С ИСПОЛЬЗОВАНИЕМ WINMERGE ИЛИ ПОДОБНОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ! </li>
	<li> ЕСЛИ ВЫ ИСПОЛЬЗУЕТЕ ИСПОЛЬЗОВАНИЕ ДРУГОГО, ЧЕМ ШАБЛОН ЗАПРАВКИ ПО УМОЛЧАНИЮ, УБЕДИТЕСЬ, ЧТО ВЫ СЛУШАЛИ ЕГО ФАЙЛЫ С ШАБЛОНОМ BOOTSTRAP KLIQQI, ПОТОМУ ЧТО НЕКОТОРЫЕ ИЗМЕНЕНИЯ БЫЛИ СДЕЛАНЫ К КОДУ. (СМ. ПРИМЕЧАНИЯ ПОСЛЕ ОБНОВЛЕНИЯ ЗАВЕРШЕНО) </li>
	</UL>
	<br /> <br />
	Обновление старых версий Pligg или Kliqqi или Plikli 4.0.0 до Plikli.' .$lang['plikli_version']. 'изменят ваши таблицы базы данных до последней версии. <br />';
	$lang['UpgradeAreYouSure'] = 'Вы действительно хотите обновить свой файл базы данных и языка?';
	$lang['UpgradeYes'] = 'Продолжить обновление';
	$lang['UpgradeLanguage'] = 'Успех, Пликли обновил ваш языковой файл. Теперь он включает в себя последние языковые элементы. ';
	$lang['UpgradingTables'] = '<strong> Обновление базы данных ... </strong>';
	$lang['LanguageUpdate'] = '<strong> Обновление языкового файла ... </strong>';
	$lang['IfNoError'] = 'Если ошибок не было, обновление завершено!';
	$lang['PleaseFix'] = 'Исправьте приведенные выше ошибки (ов), обновление остановлено!';

// Errors
	$lang['NotFound'] = 'не найден!';
	$lang['CacheNotFound'] = 'не найден! Создайте каталог /cache в корневом каталоге и установите его в CHMOD 777. ';
	$lang['DbconnectNotFound'] = 'не найден! Попробуйте переименовать dbconnect.php.default в dbconnect.php ';
	$lang['SettingsNotFound'] = 'не найден! Попробуйте переименовать settings.php.default в settings.php ';
	$lang['ZeroBytes'] = 'равно 0 байтам.';
	$lang['NotEditable'] = 'не доступен для записи. Пожалуйста, CHMOD это до 777 ';
	
?>